from datetime import date
from django.db import models

# Перелік посад в компанії
class Position(models.TextChoices):
    Partner = ('Партнер', 'Партнер')
    Counsel = ('Радник', 'Радник')
    Attorney = ('Адвокат', 'Адвокат')
    Lawyer = ('Юрист', 'Юрист')
    Courier = ("Кур'єр", "Кур'єр")
    Legal_secretary = ('Юридичний секретар', 'Юридичний секретар')

# Перелік гендерів
class Gender(models.TextChoices):
    male = ('чоловіча', 'чоловіча')
    female = ('жіноча', 'жіноча')

# Перелік освітніх та наукових ступенів
class EducationDegree(models.TextChoices):
    junior_bachelor = ('Молодший бакалавр', 'Молодший бакалавр')
    bachelor = ('Бакалавр', 'Бакалавр')
    specialist = ('Спеціаліст', 'Спеціаліст')
    master = ('Магістр', 'Магістр')
    Ph_D = ('Доктор філософії', 'Доктор філософії')
    Dr_Science = ('Доктор Наук', 'Доктор Наук')

# Перелік авторів нагород та відзнак
class RewardAuth(models.TextChoices):
    legal_500 = ('Legal 500', 'Legal 500')
    WIW_legal = ('Who is Who Legal', 'Who is Who Legal')
    best_lawyers = ('Best Lawyers', 'Best Lawyers')
    legal_practice_ua = ('Юридична практика', 'Юридична практика')
    legal_newspaper_ua = ('Юридична газета', 'Юридична газета')

# Перелік вищих навчальних закладів, що надають юридичну освіту
LEGAL_EDUCATION = [
    ('Київ',(
        ("Київський національний університет імені Тараса Шевченка", "Київський національний університет імені Тараса Шевченка"),
        ("Київський національний економічний університет імені Вадима Гетьмана", "Київський національний економічний університет імені Вадима Гетьмана"))),
    ('Харків', (
        ("Національний юридичний університет імені Ярослава Мудрого", "Національний юридичний університет імені Ярослава Мудрого"),
        ("Харківський національний університет імені В. Н. Каразіна", "Харківський національний університет імені В. Н. Каразіна"))),
    ('Одеса', (
        ("Національний університет «Одеська юридична академія", "Національний університет «Одеська юридична академія"),)),
    ('Львів', (
        ('Львівський національний університет імені Івана Франка', 'Львівський національний університет імені Івана Франка'),))]

# Перелік органів адвокатського самоврядування, що уповноважені на видачу Свідоцтв про право на зайняття адвокатською діяльністю
LAWYER_MANAGEMENT_BODIES = [
    ("Діючі органи",(
        ('Рада адвокатів Київської області', 'Рада адвокатів Київської області'),
        ('Рада адвокатів Одеської області', 'Рада адвокатів Одеської області'),
        ('Рада адвокатів Львівської області', 'Рада адвокатів Львівської області'),
        ('Рада адвокатів Харківської області', 'Рада адвокатів Харківської області'))),]

# Генератор списку років з 1970 по дійсний час
YEARS = [ (i, str(i)) for i in list(range(int(date.today().strftime('%Y')), 1970, -1))]